References/ASTT/TestSuits/Tests/MediaConf/TC.MC.NVT.24/TC.MC.NVT.24_REQ_08.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:SetVideoEncoderConfiguration>
      <trt:Configuration token="encoder1">
        <tt:Name>MPEG4 (Simple Profile), D1</tt:Name>
        <tt:UseCount>0</tt:UseCount>
        <tt:Encoding>JPEG</tt:Encoding>
        <tt:Resolution>
          <tt:Width>720</tt:Width>
          <tt:Height>576</tt:Height>
        </tt:Resolution>
        <tt:Quality>0.8</tt:Quality>
        <tt:MPEG4>
          <tt:GovLength>7</tt:GovLength>
          <tt:Mpeg4Profile>SP</tt:Mpeg4Profile>
        </tt:MPEG4>
        <tt:Multicast>
          <tt:Address>
            <tt:Type>IPv4</tt:Type>
          </tt:Address>
          <tt:Port>554</tt:Port>
          <tt:TTL>10</tt:TTL>
          <tt:AutoStart>true</tt:AutoStart>
        </tt:Multicast>
        <tt:SessionTimeout/>
      </trt:Configuration>
      <trt:ForcePersistence>true</trt:ForcePersistence>
    </trt:SetVideoEncoderConfiguration>
  </soap:Body>
</soap:Envelope>